; domain
(define (domain COOK)
	(:requirements :strips :typing :adl)
	(:types ingredient drawer)
	(:predicates (robot-at-foodstuff-station)
				 (robot-at-wash-station)
				 (robot-at-stove)
				 (in-tray ?x - ingredient)
				 (clean ?x - ingredient)
				 (holding ?x - ingredient)
				 (handempty)
				 (cooked ?x - ingredient)
				 (in-pile ?x - ingredient)
				 (on-stove ?x - ingredient)
				 (open ?y - drawer)
				 (location ?x ?y)
				 (observed ?x)
				 (served ?x)
				 (in-distribution ?x)
				 (tray-in-hand)
				 (robot-at-mug-station)
				 (food-in-saucepan)
				 (holding-cup)
				 (cup-empty)
				 (cup-at-station)
				 (can-cook)
				 (water-in-saucepan)
	)

	(:action open-drawer
			:parameters (?y - drawer)
			:precondition  (not (open ?y))
			:effect  (open ?y) 
	)

	(:action close-drawer
			:parameters (?y - drawer)
			:precondition (open ?y)
			:effect (not (open ?y))
	)

	(:action inspect
			:parameters (?x - ingredient ?y - drawer)
			:precondition (open ?y)
			:effect (when (location ?x ?y) (observed ?x))
	)

	(:action pick
			:parameters (?x - ingredient)
			:precondition (and (observed ?x) (handempty))
			:effect
			(and (holding ?x)
				 (not (handempty))) 
	)

	(:action put-on-tray
			:parameters (?x - ingredient)
			:precondition (and (holding ?x) (not (in-tray ?x)) (cooked ?x))  
			:effect
			(and (in-tray ?x)
				 (not (in-pile ?x))
				 (not (on-stove ?x))
				 (not (holding ?x))
				 (handempty)
			)
	)

	(:action carry-tray
			:parameters (?x - ingredient)
			:precondition (and (not (tray-in-hand)) (handempty) (in-tray ?x))
			:effect (tray-in-hand)
	)

	(:action wash
			:parameters (?x - ingredient)
			:precondition (and (holding ?x)  (not (clean ?x)) (robot-at-wash-station))
			:effect (and (holding ?x) (clean ?x)) 
	)

	(:action go-to-wash-station
			:parameters ()
			:precondition (and (not (robot-at-wash-station)) )
			:effect 
			(and (robot-at-wash-station)
				 (not (robot-at-foodstuff-station))
				 (not (robot-at-stove))
				 (not (robot-at-mug-station))
			)
	)

	(:action put-food-in-saucepan
			:parameters (?x - ingredient)
			:precondition (and (holding ?x)  (not (cooked ?x)) (robot-at-stove))
			:effect (and (food-in-saucepan) (handempty) (observed ?x))
	)

	(:action go-to-stove
			:parameters ()
			:precondition  ()
			:effect
			(and (robot-at-stove)
				 (not (robot-at-wash-station))
				 (not (robot-at-foodstuff-station))
				 (not (robot-at-mug-station))
			)
	)

	(:action distribute
			:parameters (?x - ingredient)
			:precondition (and (holding ?x) (cooked ?x))
			:effect (in-distribution ?x)
	)

	(:action serve
			:parameters (?x - ingredient)
			:precondition (in-distribution ?x)
			:effect (served ?x)
	)

	(:action go-to-mug-station
			:parameters ()
			:precondition ()
			:effect
			(and (robot-at-mug-station)
				 (not (robot-at-wash-station))
				 (not (robot-at-foodstuff-station))
				 (not (robot-at-stove)))
	)

	(:action get-cup
		:parameters ()
		:precondition (robot-at-mug-station)
		:effect
		(and (holding-cup)
			 (cup-empty)
		)
	)

	(:action fill-with-water
		:parameters ()
		:precondition (and (robot-at-wash-station) (holding-cup) (cup-empty))
		:effect
		(and (holding-cup)
			 (not (cup-empty))
		)
	)

	(:action pour-water-in-saucepan
		:parameters ()
		:precondition (and (robot-at-stove) (holding-cup) (not (cup-empty)))
		:effect
		(and (water-in-saucepan)
			 (cup-empty)
			 (holding-cup)
		)
	)

	(:action put-back-cup
		:parameters ()
		:precondition (and (holding-cup) (water-in-saucepan) (cup-empty) (robot-at-mug-station))
		:effect 
		(and (cup-at-station)
			 (can-cook)
		)
	)

	(:action cook
		:parameters (?x - ingredient)
		:precondition (and (can-cook) (not (cooked ?x)) (water-in-saucepan) (robot-at-stove))
		:effect
		(and (cooked ?x) (observed ?x))
	)
)

; problem
(define (problem ROBOT-COOK) 
(:domain COOK) 
 (:objects pear meat_can - ingredient
top-left top-right middle - drawer)
(:init  (clean pear) (holding pear) ) 
(:goal (and  (cooked pear) (observed pear) (handempty))))

; plan
1. (go-to-mug-station)
   added: (robot-at-mug-station)
   goals met: 0 of 3
2. (go-to-stove)
   deleted: (robot-at-mug-station)
   added: (robot-at-stove)
   goals met: 0 of 3
3. (put-food-in-saucepan pear)
   added: (food-in-saucepan) (handempty) (observed pear)
   goals met: 2 of 3
4. (go-to-mug-station)
   deleted: (robot-at-stove)
   added: (robot-at-mug-station)
   goals met: 2 of 3
5. (get-cup)
   added: (holding-cup) (cup-empty)
   goals met: 2 of 3
6. (go-to-wash-station)
   deleted: (robot-at-mug-station)
   added: (robot-at-wash-station)
   goals met: 2 of 3
7. (fill-with-water)
   deleted: (cup-empty)
   goals met: 2 of 3
8. (go-to-stove)
   deleted: (robot-at-wash-station)
   added: (robot-at-stove)
   goals met: 2 of 3
9. (pour-water-in-saucepan)
   added: (water-in-saucepan) (cup-empty)
   goals met: 2 of 3
10. (go-to-mug-station)
   deleted: (robot-at-stove)
   added: (robot-at-mug-station)
   goals met: 2 of 3
11. (put-back-cup)
   added: (cup-at-station) (can-cook)
   goals met: 2 of 3
12. (go-to-stove)
   deleted: (robot-at-mug-station)
   added: (robot-at-stove)
   goals met: 2 of 3
13. (cook pear)
   added: (cooked pear)
   goals met: 3 of 3
